name: "bge_model"
platform: "tensorrt_plan"
max_batch_size: 1

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [512]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [512]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [1024]
  }
]

instance_group [
  {
    count: 3
    kind: KIND_GPU
    gpus: [0]
  }
]

